[
  {
    "Year": 1989,
    "Note": "Griffey's rookie year, when he spent most of the season as the Mariners starting centerfielder despite being just 19 years old- the youngest player in the majors.",
    "id": 0
  },
  {
    "Year": 1990,
    "Note": "He is the first Mariner elected as an All-Star starter, and he and his dad become the first father-son duo to hit back-to-back home runs.",
    "id": 1
  },
  {
    "Year": 1991,
    "Note": "Griffey continues to develop and has his best season yet, leading the Mariners to their first-ever winning season.",
    "id": 2
  },
  {
    "Year": 1992,
    "Note": "Griffey puts together another strong season, highlighted by earning All-Star Game MVP honors after a 3-for-3 performance, including a home run.",
    "id": 3
  },
  {
    "Year": 1993,
    "id": 4
  },
  {
    "Year": 1994,
    "id": 5
  },
  {
    "Year": 1995,
    "Note": "Griffey suffered a severe wrist injury on May 26, 1995, while making a leaping catch into the outfield wall. It sidelined him until mid-August",
    "id": 6
  },
  {
    "Year": 1996,
    "id": 7
  },
  {
    "Year": 1997,
    "Note": "His best home-run seasons were 1997 and 1998, when he hit 56 each year",
    "id": 8
  },
  {
    "Year": 1998,
    "Note": "His best home-run seasons were 1997 and 1998, when he hit 56 each year",
    "id": 9
  },
  {
    "Year": 1999,
    "Note": "Griffey was traded to Cincinnati following the 1999 Mariners season, having hit 398 homers in 11 years here",
    "id": 10
  },
  {
    "Year": 2000,
    "id": 11
  },
  {
    "Year": 2001,
    "id": 12
  },
  {
    "Year": 2002,
    "id": 13
  },
  {
    "Year": 2003,
    "Note": "Injuries forced Griffey to miss 260 out of 486 games with the Reds from 2002-2004",
    "id": 14
  },
  {
    "Year": 2004,
    "id": 15
  },
  {
    "Year": 2005,
    "id": 16
  },
  {
    "Year": 2006,
    "id": 17
  },
  {
    "Year": 2007,
    "id": 18
  },
  {
    "Year": 2008,
    "Note": "Griffey was traded during the 2008 season and hit three homers with the White Sox",
    "id": 19
  },
  {
    "Year": 2009,
    "Note": "Griffey returns to Mariners and hits 19 homers in 2009",
    "id": 20
  },
  {
    "Year": 2010,
    "id": 21
  }
]