[
  {
    "Year": 1989,
    "Note": "Griffey's rookie year, when he spent most of the season as the Mariners starting centerfielder despite being just 19 years old- the youngest player in the majors.",
    "id": 0
  },
  {
    "Year": 1990,
    "Note": "He is the first Mariner elected as an All-Star starter, and he and his dad become the first father-son duo to hit back-to-back home runs.",
    "id": 1
  },
  {
    "Year": 1991,
    "Note": "Griffey continues to develop and has his best season yet, leading the Mariners to their first-ever winning season.",
    "id": 2
  },
  {
    "Year": 1992,
    "Note": "Griffey puts together another strong season, highlighted by earning All-Star Game MVP honors after a 3-for-3 performance, including a home run.",
    "id": 3
  },
  {
    "Year": 1993,
    "Note": "The Kid has a power spike, famously becoming the first player to hit the warehouse beyond right field at Camden Yards in the Home Run Derby and tieing a major league record by homering in eight consecutive games.",
    "id": 4
  },
  {
    "Year": 1994,
    "Note": "Griffey leads the American League in homers, becoming the first Mariner to do so, and also becomes the all-time Mariners' home run leader.",
    "id": 5
  },
  {
    "Year": 1995,
    "Note": "Misses almost half the season with a broken wrist, but comes back to help lead the Mariners to a miraculous AL West title and a thrilling comeback win in the ALDS, when Griffey scores the series-winning run on 'The Double.'",
    "id": 6
  },
  {
    "Year": 1996,
    "Note": "Griffey sets a new career high in home runs, including his 200th career blast on May 21.",
    "id": 7
  },
  {
    "Year": 1997,
    "Note": "Griffey's best season- he is unanimously voted as league MVP, and leads the Mariners to the AL West title for the second time in three years.",
    "id": 8
  },
  {
    "Year": 1998,
    "Note": "Ties his career high for home runs in a season, including becoming at age 28 the youngest player ever to reach 350 home runs.",
    "id": 9
  },
  {
    "Year": 1999,
    "Note": "Griffey hits the last ever home run at the Kingdome as the Mariners transition to Safeco field, and at the end of the year Griffey is named the player of the decade.",
    "id": 10
  },
  {
    "Year": 2000,
    "Note": "On February 10, Griffey is traded to his hometown team, the Cincinatti Reds. He puts up a strong first year with his new team.",
    "id": 11
  },
  {
    "Year": 2001,
    "Note": "Injuries begin to derail Griffey's career, as he doesn't make his first start until mid-June due to a hamstring injury. He does hit well when he plays, however.",
    "id": 12
  },
  {
    "Year": 2002,
    "Note": "Griffey plays in just 70 games due to a variety of injuries, and he takes a step back when he does play, hitting less than 16 home runs for the first time in his career.",
    "id": 13
  },
  {
    "Year": 2003,
    "Note": "Griffey is on pace for a bounce-back season, but tears a tendon in his ankle in July and is forced to miss the rest of the season.",
    "id": 14
  },
  {
    "Year": 2004,
    "Note": "Injuries again limit Griffey, although he does reach the 500 home run mark on June 20.",
    "id": 15
  },
  {
    "Year": 2005,
    "Note": "Is voted NL comeback player of the year in a strong season in which he plays more than 100 games for the first time since 2001.",
    "id": 16
  },
  {
    "Year": 2006,
    "Note": "Moves into the top ten all time in career home runs, although injuries again force Griffey to miss more than 50 games.",
    "id": 17
  },
  {
    "Year": 2007,
    "Note": "Griffey returns to Safeco for the first time since being traded and is welcomed back by the home fans, and ends up hitting two home runs in the final game of the series.",
    "id": 18
  },
  {
    "Year": 2008,
    "Note": "Hits home run number 600, and then is traded midseason to the Chicago White Sox, with whom he makes his final playoff appearance.",
    "id": 19
  },
  {
    "Year": 2009,
    "Note": "Griffey signs with the Mariners in February, and a feel-good season is capped off when Griffey is carried off the field by his teammates after the final game of the season.",
    "id": 20
  },
  {
    "Year": 2010,
    "Note": "Griffey signs another one-year deal with the Mariners, but struggles mightily, and retires on June 2, 23 years to the day after he had first been drafted by Seattle.",
    "id": 21
  }
]